IDEA StatiCa Open Model
ArcSegment2D Constructor
Compatible with IDEA StatiCa Beta 21.0 - beta
Initializes a new instance of the ArcSegment2D class
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ArcSegment2D()
Public Sub New
public:
ArcSegment2D()
See Also
Reference
ArcSegment2D Class
IdeaRS.OpenModel.Geometry2D Namespace